const DATA = {
  "数学": {

  
    "慈恵": {
      "2021年": {
        "_comment": "大問3ができない。",
        "_date": "2026-08-27",

        "大問1": {
          score: "25",
          maxScore: "25",
          failed: "なし",
          needed: "今回は解けたけど、確率の応用問題を安定感を持って点数取れるようになりたい"
        },

         "大問2": {
          score: "15",
          maxScore: "25",
          failed: "S2をどうはさめばはさみうちの原理を使えるのかわからなかった。",
          needed: "どことどこではさめば、はさみうちの原理を使えるかわかれば解けた"
        },

          "大問3": {
          score: "4",
          maxScore: "25",
          failed: "",
          needed: "見慣れない問題で何が必要なのかわからない。"
        },

        "大問4": {
          score: "0",
          maxScore: "25",
          failed: "計算ミス多発",
          needed: "結果的に解けなかったが解き方は解答速報と同じだった"
        }
      },
      "2022年": {
        "_comment": "",
        "_date": "2026-08-28",

        "大問1": {
          score: "25",
          maxScore: "25",
          failed: "",
          needed: ""
        },
        "大問2": {
          score: "8",
          maxScore: "25",
          failed: "(2)の複雑な分数関数の微分を間違えて、その先の増減表が書けなかった",
          needed: "微分するときにミスしない"
        },
        "大問3": {
          score: "5",
          maxScore: "25",
          failed: "(1)の証明で躓いた。どの速報にも(a2)^2=a3って書いてあるけど、その理由が本当に理解できない。",
          needed: "整数の証明問題の練習"
        },
        "大問4": {
          score: "10",
          maxScore: "25",
          failed: "複素数平面の応用問題で、どこを文字に置いてどう解くのかわからなかった。",
          needed: "複素数平面の問題を解く"
        }
      },
      "2023年": {
        "_comment": "塾で習った無限降下法使えなかったのが悔しい",
        "_date": "2026-08-28",

        "大問1": {
          score: "25",
          maxScore: "25",
          failed: "",
          needed: "慈恵の大問1は必ず確率問題"
        },
        "大問2": {
          score: "10",
          maxScore: "25",
          failed: "(2)の途中で躓いた",
          needed: ""
        },
        "大問3": {
          score: "0",
          maxScore: "25",
          failed: "無限降下法を使う証明問題",
          needed: ""
        },
        "大問4": {
          score: "0",
          maxScore: "25",
          failed: "手が動かなかった。",
          needed: "復習して次から解けるようにする"
        }
      },
    },

        "国際医療福祉大学": {
      "2025年": {
        "_comment": "時間が足りない。時間制限内64%, 外99%(chatgpt採点)",
        "_date": "2026-08-29",

        "大問1": {
          score: "25",
          maxScore: "25",
          failed: "なし",
          needed: ""
        },

         "大問2": {
          score: "7",
          maxScore: "21",
          failed: "時間が足りなかった",
          needed: ""
        },

          "大問3": {
          score: "10",
          maxScore: "27",
          failed: "時間があれば26/27取れた。(3)(ii)(ネ)だけ間違えた、終わった後落ち着いて考えたらできる",
          needed: "早く確実に解く"
        },

        "大問4": {
          score: "21",
          maxScore: "25",
          failed: "時間があれば満点取れた",
          needed: ""
        }
      },
    },

        "昭和医科大学": {
      "2020年": {
        "_comment": "大問1(4)と大問4(3)以外は全部初見で解けた。時間制限内では64%で時間外に解いたのも含めると91%解けた（chatgpt採点）。",
        "_date": "2026-10-27",

        "大問1": {
          score: "19",
          maxScore: "25",
          failed: "(4)のみ解けなかった、複素数平面の図形問題が慣れてなくて発想が出なかった",
          needed: "複素数の回転を使う図形問題に慣れる"
        },

         "大問2": {
          score: "8",
          maxScore: "25",
          failed: "ミス、時間制限外では全部解けた",
          needed: "確実にとく"
        },

          "大問3": {
          score: "20",
          maxScore: "25",
          failed: "ミス、時間外では解けた",
          needed: "確実に解く"
        },

        "大問4": {
          score: "17",
          maxScore: "25",
          failed: "最後の(3)の積分問題が解けなかった、描く図形が特殊で何をすればいいのかわからなかった",
          needed: "二つの曲線で囲まれた面積を出すときは、二つの関数の上下関係が分かれば簡単に積分できてその上下関係の調べ方を覚えとく"
        }
      },
      "2021年": {
        "_comment": "",
        "_date": "2026-08-28",

        "大問1": {
          score: "25",
          maxScore: "25",
          failed: "",
          needed: ""
        },
        "大問2": {
          score: "8",
          maxScore: "25",
          failed: "(2)の複雑な分数関数の微分を間違えて、その先の増減表が書けなかった",
          needed: "微分するときにミスしない"
        },
        "大問3": {
          score: "5",
          maxScore: "25",
          failed: "(1)の証明で躓いた。どの速報にも(a2)^2=a3って書いてあるけど、その理由が本当に理解できない。",
          needed: "整数の証明問題の練習"
        },
        "大問4": {
          score: "10",
          maxScore: "25",
          failed: "複素数平面の応用問題で、どこを文字に置いてどう解くのかわからなかった。",
          needed: "複素数平面の問題を解く"
        }
      },
      "2023年": {
        "_comment": "塾で習った無限降下法使えなかったのが悔しい",
        "_date": "2026-08-28",

        "大問1": {
          score: "25",
          maxScore: "25",
          failed: "",
          needed: "慈恵の大問1は必ず確率問題"
        },
        "大問2": {
          score: "10",
          maxScore: "25",
          failed: "(2)の途中で躓いた",
          needed: ""
        },
        "大問3": {
          score: "0",
          maxScore: "25",
          failed: "無限降下法を使う証明問題",
          needed: ""
        },
        "大問4": {
          score: "0",
          maxScore: "25",
          failed: "手が動かなかった。",
          needed: "復習して次から解けるようにする"
        }
      },
    },

   
      
      
  },

  "英語": {

  }
};
