const DATA = {
  "数学": {

  
    "慈恵": {
      "2021年": {
        "_comment": "大問3ができない。",
        "_date": "2026-08-27",

        "大問1": {
          score: "25",
          maxScore: "25",
          failed: "なし",
          needed: "今回は解けたけど、確率の応用問題を安定感を持って点数取れるようになりたい"
        },

         "大問2": {
          score: "15",
          maxScore: "25",
          failed: "S2をどうはさめばはさみうちの原理を使えるのかわからなかった。",
          needed: "どことどこではさめば、はさみうちの原理を使えるかわかれば解けた"
        },

          "大問3": {
          score: "4",
          maxScore: "25",
          failed: "",
          needed: "見慣れない問題で何が必要なのかわからない。"
        },

        "大問4": {
          score: "0",
          maxScore: "25",
          failed: "計算ミス多発",
          needed: "結果的に解けなかったが解き方は解答速報と同じだった"
        }
      },
      "2022年": {
        "_comment": "",
        "_date": "2026-08-28",

        "大問1": {
          score: "25",
          maxScore: "25",
          failed: "",
          needed: ""
        },
        "大問2": {
          score: "8",
          maxScore: "25",
          failed: "(2)の複雑な分数関数の微分を間違えて、その先の増減表が書けなかった",
          needed: "微分するときにミスしない"
        },
        "大問3": {
          score: "5",
          maxScore: "25",
          failed: "(1)の証明で躓いた。どの速報にも(a2)^2=a3って書いてあるけど、その理由が本当に理解できない。",
          needed: "整数の証明問題の練習"
        },
        "大問4": {
          score: "10",
          maxScore: "25",
          failed: "複素数平面の応用問題で、どこを文字に置いてどう解くのかわからなかった。",
          needed: "複素数平面の問題を解く"
        }
      },
      "2023年": {
        "_comment": "塾で習った無限降下法使えなかったのが悔しい",
        "_date": "2026-08-28",

        "大問1": {
          score: "25",
          maxScore: "25",
          failed: "",
          needed: "慈恵の大問1は必ず確率問題"
        },
        "大問2": {
          score: "10",
          maxScore: "25",
          failed: "(2)の途中で躓いた",
          needed: ""
        },
        "大問3": {
          score: "0",
          maxScore: "25",
          failed: "無限降下法を使う証明問題",
          needed: ""
        },
        "大問4": {
          score: "0",
          maxScore: "25",
          failed: "手が動かなかった。",
          needed: "復習して次から解けるようにする"
        }
      },
    },
   
  },

  "英語": {
    "順天堂大学": {
      "2025年": {
        "_comment": "内容一致の精度を上げたい。",
        "_date": "2026-08-18",

        "大問1": {
          score: 16,
          maxScore: 20,
          failed: "設問の根拠箇所を1つ読み違えた。",
          needed: "選択肢と本文を一文ずつ対応させれば防げた。"
        }
      }
    }
  }
};
